Revit 2024 API
ExternalResourceSubFolder Members
The ExternalResourceSubFolder type exposes the following members.
Constructors
Name | Description
ExternalResourceSubFolder()
 Constructs a new ExternalResourceSubFolder with default values for folder name and icon path.
ExternalResourceSubFolder(String, String)
 Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalResourceSubFolder
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
FolderName
 Folder displayed name.
IconPath
 The path of the resource icon.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace